In [34]:
import pandas as pd
import numpy as np

In [35]:
df = pd.read_csv("C:\\Users\\nagal\\OneDrive\\Desktop\\DS_18_JULY_2022-master\\pandas\\marks.csv")

In [36]:
df

      Bill    Java    90
0     Bill  Python  95.0
1    Steve    Java  80.0
2    Steve       C  90.0
3  Roberts    HTML  98.0
4  Roberts    Java  60.0
5  Roberts  Python  70.0
6    Steve  Python   NaN
7    Henry     NaN  60.0
8    Steve  Python  94.0

In [37]:
df.to_csv("marks.csv")

In [38]:
df

      Bill    Java    90
0     Bill  Python  95.0
1    Steve    Java  80.0
2    Steve       C  90.0
3  Roberts    HTML  98.0
4  Roberts    Java  60.0
5  Roberts  Python  70.0
6    Steve  Python   NaN
7    Henry     NaN  60.0
8    Steve  Python  94.0

In [39]:
df = pd.read_csv('marks.csv',header=None, names=['name','subject','marks'])

In [40]:
df

        name subject  marks
NaN     Bill    Java   90.0
0.0     Bill  Python   95.0
1.0    Steve    Java   80.0
2.0    Steve       C   90.0
3.0  Roberts    HTML   98.0
4.0  Roberts    Java   60.0
5.0  Roberts  Python   70.0
6.0    Steve  Python    NaN
7.0    Henry     NaN   60.0
8.0    Steve  Python   94.0

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 10 entries, nan to 8.0
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     10 non-null     object
 1   subject  9 non-null      object
 2   marks    9 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [42]:
df.columns

Index(['name', 'subject', 'marks'], dtype='object')

In [43]:
df.size

30

In [44]:
df.shape

(10, 3)

In [45]:
df.values

array([['Bill', 'Java', 90.0],
       ['Bill', 'Python', 95.0],
       ['Steve', 'Java', 80.0],
       ['Steve', 'C', 90.0],
       ['Roberts', 'HTML', 98.0],
       ['Roberts', 'Java', 60.0],
       ['Roberts', 'Python', 70.0],
       ['Steve', 'Python', nan],
       ['Henry', nan, 60.0],
       ['Steve', 'Python', 94.0]], dtype=object)

In [46]:
df.describe()

           marks
count   9.000000
mean   81.888889
std    15.053608
min    60.000000
25%    70.000000
50%    90.000000
75%    94.000000
max    98.000000

In [47]:
df.describe(include = "all")

         name subject      marks
count      10       9   9.000000
unique      4       4        NaN
top     Steve  Python        NaN
freq        4       4        NaN
mean      NaN     NaN  81.888889
std       NaN     NaN  15.053608
min       NaN     NaN  60.000000
25%       NaN     NaN  70.000000
50%       NaN     NaN  90.000000
75%       NaN     NaN  94.000000
max       NaN     NaN  98.000000

In [48]:
df.axes

[Float64Index([nan, 0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0], dtype='float64'),
 Index(['name', 'subject', 'marks'], dtype='object')]

### RETRIEVING DATA

In [49]:
df.subject

NaN      Java
0.0    Python
1.0      Java
2.0         C
3.0      HTML
4.0      Java
5.0    Python
6.0    Python
7.0       NaN
8.0    Python
Name: subject, dtype: object

In [50]:
df.head()

        name subject  marks
NaN     Bill    Java   90.0
0.0     Bill  Python   95.0
1.0    Steve    Java   80.0
2.0    Steve       C   90.0
3.0  Roberts    HTML   98.0

In [51]:
df[["name", "marks"]]

        name  marks
NaN     Bill   90.0
0.0     Bill   95.0
1.0    Steve   80.0
2.0    Steve   90.0
3.0  Roberts   98.0
4.0  Roberts   60.0
5.0  Roberts   70.0
6.0    Steve    NaN
7.0    Henry   60.0
8.0    Steve   94.0

In [52]:
df[3 : 7]   # SLICING BY INDEX

        name subject  marks
3.0  Roberts    HTML   98.0
4.0  Roberts    Java   60.0
5.0  Roberts  Python   70.0
6.0    Steve  Python    NaN
7.0    Henry     NaN   60.0

In [53]:
# df[3] # column name

### at, iat, loc, iloc attributes

In [54]:
!cd

C:\Users\nagal\demo\pandas

In [65]:
# at, iat do not support slicing
print(df.at[0, "marks"])   # ROW LABEL AND COLUMN LABEL
print(df.iat[0, 2])   # ROW POSITION AND COLUMN POSITION

95.0
90.0

In [58]:
df.marks > 80

NaN     True
0.0     True
1.0    False
2.0     True
3.0     True
4.0    False
5.0    False
6.0    False
7.0    False
8.0     True
Name: marks, dtype: bool

In [59]:
df[df.marks > 80]  # BOOLEAN INDEXING

        name subject  marks
NaN     Bill    Java   90.0
0.0     Bill  Python   95.0
2.0    Steve       C   90.0
3.0  Roberts    HTML   98.0
8.0    Steve  Python   94.0

In [60]:
df[df.marks > 80].marks

NaN    90.0
0.0    95.0
2.0    90.0
3.0    98.0
8.0    94.0
Name: marks, dtype: float64

In [62]:
df[df.marks > 80][["name", "marks"]]

        name  marks
NaN     Bill   90.0
0.0     Bill   95.0
2.0    Steve   90.0
3.0  Roberts   98.0
8.0    Steve   94.0

### loc and iloc

In [67]:
df.loc[7, "name"]

'Henry'

In [69]:
df.loc[df.marks > 80, ["name", "marks"]]

        name  marks
NaN     Bill   90.0
0.0     Bill   95.0
2.0    Steve   90.0
3.0  Roberts   98.0
8.0    Steve   94.0

In [70]:
df.loc[:8, : "subject"]    # ROWS UPTO ROW-LABEL 8, COLS UPTO SUBJECT

        name subject
NaN     Bill    Java
0.0     Bill  Python
1.0    Steve    Java
2.0    Steve       C
3.0  Roberts    HTML
4.0  Roberts    Java
5.0  Roberts  Python
6.0    Steve  Python
7.0    Henry     NaN
8.0    Steve  Python

### MASKING

In [71]:
(df.subject == "Python")

NaN    False
0.0     True
1.0    False
2.0    False
3.0    False
4.0    False
5.0     True
6.0     True
7.0    False
8.0     True
Name: subject, dtype: bool

In [72]:
(df.subject == "Python") & (df.marks > 80)

NaN    False
0.0     True
1.0    False
2.0    False
3.0    False
4.0    False
5.0    False
6.0    False
7.0    False
8.0     True
dtype: bool

In [74]:
df[(df.subject == "Python") & (df.marks > 80)]

      name subject  marks
0.0   Bill  Python   95.0
8.0  Steve  Python   94.0

In [75]:
df.loc[1:5, "name" : "subject"]

        name subject
1.0    Steve    Java
2.0    Steve       C
3.0  Roberts    HTML
4.0  Roberts    Java
5.0  Roberts  Python

In [76]:
df.loc[df.marks > 60, "subject":]

    subject  marks
NaN    Java   90.0
0.0  Python   95.0
1.0    Java   80.0
2.0       C   90.0
3.0    HTML   98.0
5.0  Python   70.0
8.0  Python   94.0

In [77]:
df.iloc[0:2, 0:2]

     name subject
NaN  Bill    Java
0.0  Bill  Python

### sample, isin, where, filter

In [78]:
df.sample(5)   # RANDOM 5 SELECTED ROWS

        name subject  marks
NaN     Bill    Java   90.0
4.0  Roberts    Java   60.0
7.0    Henry     NaN   60.0
1.0    Steve    Java   80.0
0.0     Bill  Python   95.0

In [79]:
df.subject.isin(["Python", "Java"])

NaN     True
0.0     True
1.0     True
2.0    False
3.0    False
4.0     True
5.0     True
6.0     True
7.0    False
8.0     True
Name: subject, dtype: bool

In [80]:
# GET ROWS RELATED TO Python and Java
df[df.subject.isin(["Python","Java"])]

        name subject  marks
NaN     Bill    Java   90.0
0.0     Bill  Python   95.0
1.0    Steve    Java   80.0
4.0  Roberts    Java   60.0
5.0  Roberts  Python   70.0
6.0    Steve  Python    NaN
8.0    Steve  Python   94.0

In [81]:
df.where(df.marks > 80)   # It does not change the dimensions and give NaN where condition fails

        name subject  marks
NaN     Bill    Java   90.0
0.0     Bill  Python   95.0
1.0      NaN     NaN    NaN
2.0    Steve       C   90.0
3.0  Roberts    HTML   98.0
4.0      NaN     NaN    NaN
5.0      NaN     NaN    NaN
6.0      NaN     NaN    NaN
7.0      NaN     NaN    NaN
8.0    Steve  Python   94.0

In [82]:
df.filter(regex = "e$") # select columns where column name ends with letter e

        name
NaN     Bill
0.0     Bill
1.0    Steve
2.0    Steve
3.0  Roberts
4.0  Roberts
5.0  Roberts
6.0    Steve
7.0    Henry
8.0    Steve

In [86]:
df.filter(regex = "0 - 8")

Empty DataFrame
Columns: []
Index: [nan, 0.0, 1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0]

In [88]:
df.filter(regex = "5", axis = 0)   # FILTER BY ROWS

        name subject  marks
5.0  Roberts  Python   70.0

### OPERATIONS ON COLUMNS

In [89]:
df["marks"] - 50

NaN    40.0
0.0    45.0
1.0    30.0
2.0    40.0
3.0    48.0
4.0    10.0
5.0    20.0
6.0     NaN
7.0    10.0
8.0    44.0
Name: marks, dtype: float64

In [90]:
df

        name subject  marks
NaN     Bill    Java   90.0
0.0     Bill  Python   95.0
1.0    Steve    Java   80.0
2.0    Steve       C   90.0
3.0  Roberts    HTML   98.0
4.0  Roberts    Java   60.0
5.0  Roberts  Python   70.0
6.0    Steve  Python    NaN
7.0    Henry     NaN   60.0
8.0    Steve  Python   94.0

### nlargest, nsmallest

In [91]:
df.nlargest(4, "marks")    # keep = True

        name subject  marks
3.0  Roberts    HTML   98.0
0.0     Bill  Python   95.0
8.0    Steve  Python   94.0
NaN     Bill    Java   90.0

In [92]:
df.nlargest(4, "marks", keep = "all")

        name subject  marks
3.0  Roberts    HTML   98.0
0.0     Bill  Python   95.0
8.0    Steve  Python   94.0
NaN     Bill    Java   90.0
2.0    Steve       C   90.0
6.0    Steve  Python    NaN

In [94]:
df[["name", "subject"]].drop_duplicates()

        name subject
NaN     Bill    Java
0.0     Bill  Python
1.0    Steve    Java
2.0    Steve       C
3.0  Roberts    HTML
4.0  Roberts    Java
5.0  Roberts  Python
6.0    Steve  Python
7.0    Henry     NaN

In [95]:
df["name"].drop_duplicates()

NaN       Bill
1.0      Steve
3.0    Roberts
7.0      Henry
Name: name, dtype: object

In [96]:
df.subject.dropna().unique()

array(['Java', 'Python', 'C', 'HTML'], dtype=object)

### apply() and applymap()

In [104]:
# s is a series
def count_nulls(s):
    return s.isnull().sum()

In [105]:
df.apply(count_nulls)

name       0
subject    1
marks      1
dtype: int64

In [106]:
df.apply(lambda s : s.notnull().sum())   # APPLY OPERATION ON EACH COLUMN

name       10
subject     9
marks       9
dtype: int64

In [108]:
df.apply(lambda s : s.notnull().sum(), axis = 1)   # APPLY OPERSTION ON EACH ROW

NaN    3
0.0    3
1.0    3
2.0    3
3.0    3
4.0    3
5.0    3
6.0    2
7.0    2
8.0    3
dtype: int64

### DIFFERENCE BETWEEN DATAFRAME AND SERIES SYNTAX

In [111]:
type(df[["name"]]), type(df.name)

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [112]:
df[["name", "subject"]].apply(lambda s : s.isnull().sum())

name       0
subject    1
dtype: int64

In [115]:
df[["name", "subject"]].applymap(lambda v : str(v).upper())

        name subject
NaN     BILL    JAVA
0.0     BILL  PYTHON
1.0    STEVE    JAVA
2.0    STEVE       C
3.0  ROBERTS    HTML
4.0  ROBERTS    JAVA
5.0  ROBERTS  PYTHON
6.0    STEVE  PYTHON
7.0    HENRY     NAN
8.0    STEVE  PYTHON

In [116]:
df[['name','subject']].applymap(lambda v : str(v).upper())

        name subject
NaN     BILL    JAVA
0.0     BILL  PYTHON
1.0    STEVE    JAVA
2.0    STEVE       C
3.0  ROBERTS    HTML
4.0  ROBERTS    JAVA
5.0  ROBERTS  PYTHON
6.0    STEVE  PYTHON
7.0    HENRY     NAN
8.0    STEVE  PYTHON

In [117]:
def convert_upper(v):
    if isinstance(v, str):
        return v.strip().upper()
    else:
        return str(v)

In [118]:
df.applymap(lambda v : str(v).upper())

        name subject marks
NaN     BILL    JAVA  90.0
0.0     BILL  PYTHON  95.0
1.0    STEVE    JAVA  80.0
2.0    STEVE       C  90.0
3.0  ROBERTS    HTML  98.0
4.0  ROBERTS    JAVA  60.0
5.0  ROBERTS  PYTHON  70.0
6.0    STEVE  PYTHON   NAN
7.0    HENRY     NAN  60.0
8.0    STEVE  PYTHON  94.0

In [119]:
df[["name", "subject", "marks"]].applymap(convert_upper)

        name subject marks
NaN     BILL    JAVA  90.0
0.0     BILL  PYTHON  95.0
1.0    STEVE    JAVA  80.0
2.0    STEVE       C  90.0
3.0  ROBERTS    HTML  98.0
4.0  ROBERTS    JAVA  60.0
5.0  ROBERTS  PYTHON  70.0
6.0    STEVE  PYTHON   nan
7.0    HENRY     nan  60.0
8.0    STEVE  PYTHON  94.0